app/views/cart/index.html.erb

SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---

  <% @user.items.each do |item| %>
    <tr>
      <td><%= Purchase.find(item.purchase_id).name %></td>
      <td>$<%= Purchase.find(item.purchase_id).price %></td>