app/views/carts/new.html.erb

SELECT "purchases".* FROM "purchases"
---
<%= form_for(@user, :url => items_new) do |f| %>
  <%= f.collection_select :purchase_ids, Purchase.all, :name, :name %>