app/views/carts/show.html.erb


  <% @user.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]


<strong>Number of Items:</strong> <%= @user.items.count %><br>
---
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]