app/views/items/edit.html.erb

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
<h1> <%= Purchase.find(@item.purchase_id).name %> </h1>

<h3> Price: <%= Purchase.find(@item.purchase_id).price %> </h3>