app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def current_user
    # If the session has the user_id stored, save it to the instance variable current_user
    @current_user ||= User.find(session[:user_id]) if session[:user_id]