app/controllers/cart_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @items = Item.all
    @user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def show
    @item = User.items.find(params[:id])