app/controllers/carts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "purchases".* FROM "purchases"
---
  def new
    @user = User.find(params[:user_id])
    @purchase = Purchase.new
    @purchases = Purchase.all