app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."user_id" = ? AND "items"."purchase_id" = ? LIMIT ?  [["user_id", 1], ["purchase_id", 14], ["LIMIT", 1]]
INSERT INTO "items" ("user_id", "purchase_id", "quantity") VALUES (?, ?, ?)  [["user_id", 1], ["purchase_id", 14], ["quantity", 1]]
UPDATE "purchases" SET "quantity" = ? WHERE "purchases"."id" = ?  [["quantity", 2], ["id", 2]]
UPDATE "users" SET "money" = ? WHERE "users"."id" = ?  [["money", 17], ["id", 1]]
UPDATE "items" SET "quantity" = ? WHERE "items"."id" = ?  [["quantity", 2], ["id", 3]]
---
  def new
     # Join table method that creates a new item that connects a user to a purchase
    @item = Item.find_by(:user_id => params[:user_id], :purchase_id => params[:purchase_id])
    if @item == nil
      @item = Item.create(
        :user_id => params[:user_id],
        :purchase_id => params[:purchase_id],
        :quantity => 1
      )
    else
      @item.quantity += 1
      @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "quantity" = ? WHERE "items"."id" = ?  [["quantity", nil], ["id", 1]]
---
  def update
    binding.pry
    @item = Item.find(params[:id])
    @item.update(quantity: params[:quantity])