app/controllers/purchases_controller.rb

SELECT "purchases".* FROM "purchases"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @purchases = Purchase.all
    @user = User.find(session[:user_id])

INSERT INTO "purchases" ("name", "price", "quantity") VALUES (?, ?, ?)  [["name", "Glad Zipper Food Storage bags"], ["price", 3.0], ["quantity", 10]]
---
  def create
    @purchase = Purchase.new(purchase_params)
    respond_to do |format|
      if @purchase.save

UPDATE "purchases" SET "name" = ? WHERE "purchases"."id" = ?  [["name", "Tropicana Fruit Punch"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @purchase.update(purchase_params)

DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 7]]
SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def destroy
    # Delets the purchasing you're looking at in the purchases#show view
    Purchase.find(params[:id]).destroy

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def set_purchase
    @purchase = Purchase.find(params[:id])