app/controllers/sessions_controller.rb

  def new
    @user = User.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    if auth_hash
      @user = User.find_or_create_by(name: auth_hash['info']['name'])
      @user.password = "password"
      @user.money = 20
      @user.save
      session[:user_id] = @user.id
      redirect_to user_path(@user), notice: "Welcome to The Bodega!!"
    elsif
      @user = User.find_by(name: params[:user][:name])
---
INSERT INTO "users" ("name", "password_digest") VALUES (?, ?)  [["name", "Lekan Nicholson"], ["password_digest", "$2a$10$m3Bk74ifNUD3lglK3bgRN.IG59PLQfWAEhTEQJeSzDAtZXZY0M2yG"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "10211965061986827"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$J.s54EKAjAzwpfKYlghfB.UBTY6fBTe5.zFU3rmTiXM4FhTcUroGW"], ["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Sam"], ["LIMIT", 1]]