app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "money", "admin") VALUES (?, ?, ?, ?)  [["name", "Olive DeAngelis"], ["password_digest", "$2a$10$2Bt5vnqxVD5TDZ1pwOVY4edaTRt12uG4ZBn5aB3odK9ym8Q5ZdneO"], ["money", 10.0], ["admin", 1]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ? WHERE "users"."id" = ?  [["name", "Oscar McCamy"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)