app/models/item.rb

UPDATE "purchases" SET "quantity" = ? WHERE "purchases"."id" = ?  [["quantity", 2], ["id", 4]]
UPDATE "users" SET "money" = ? WHERE "users"."id" = ?  [["money", 15.0], ["id", 2]]
UPDATE "purchases" SET "quantity" = ? WHERE "purchases"."id" = ?  [["quantity", 8], ["id", 2]]
UPDATE "users" SET "money" = ? WHERE "users"."id" = ?  [["money", 99.0], ["id", 1]]
---
  def update_puchase
    new_quantity = self.purchase.quantity - 1
    new_money = self.user.money - self.purchase.price
    self.user.update(
      :money => new_money
    )
    self.purchase.update(
      :quantity => new_quantity
    )