app/models/purchase.rb

SELECT  "purchases".* FROM "purchases" ORDER BY price DESC LIMIT ?  [["LIMIT", 1]]
---
  def self.most_expensive
    order("price DESC").first

SELECT MIN("purchases"."price") FROM "purchases"
SELECT  "purchases".* FROM "purchases" ORDER BY price ASC LIMIT ?  [["LIMIT", 1]]
---
  def self.least_expensive
    order("price ASC").first