app/models/user.rb

SELECT COUNT(*) FROM "purchases" INNER JOIN "items" ON "purchases"."id" = "items"."purchase_id" WHERE "items"."user_id" = ?  [["user_id", 1]]
---
  def num_of_items
    self.purchases.count

SELECT "purchases".* FROM "purchases" INNER JOIN "items" ON "purchases"."id" = "items"."purchase_id" WHERE "items"."user_id" = ?  [["user_id", 1]]
---
  def cart
    # Shows the collection of purchases the user has
    self.purchases.each do |purchase|

SELECT "purchases".* FROM "purchases" INNER JOIN "items" ON "purchases"."id" = "items"."purchase_id" WHERE "items"."user_id" = ?  [["user_id", 1]]
---
  def cart_total
    # Gives the total price of all the purchases the user made
    self.purchases.sum do |purchase|

SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
---
  def cart_quantity
    self.items.sum do |item|